{"customFields":{},"pap":2,"metrics":{},"tasks":[{"description":"_Objective:  Gather events from various sources (log files, error messages,etc.) in order to determine if an incident has occurred.  If an incident has occurred, determine scope and parties involved.  This is also the phase where incident responders should be documenting everything that they are doing, as stated earlier these documents should be able to answer the Who, What, Where, Why, and How questions._\n\n**Upload Observables**\n* Email \n* Attachment hash \n* URLs \n* URL IP \n* Sender Address \n* Sender IP \n* IP Address of O365 portal login \n\nRun Analyzers ","title":"Identifcation","order":0,"group":"STAGE 1"},{"description":"_Objective: Limit the damage and prevent any further damage from happening. Short term containment followed by long term solution._\n\n* Reset passwords","title":"Containment","order":1,"group":"STAGE 2"},{"description":"_Objective: Ensure all proper steps were taken to remove malicious and other illicit content and all systems have been restored to a clean stated._\n\n* Remove unauthorized inbox rules.\n* Identify other accounts that may have been compromised. ","title":"Eradication","order":2,"group":"STAGE 3"},{"description":"_Objective: Ensure all proper steps were taken to remove malicious and other illicit content and all systems have been restored to a clean stated._\n\n**Unblock User from Sending Mail**\n* Requesting unblocking of account. ","title":"Recovery","order":3,"group":"STAGE 4"},{"description":"_Objective: Complete any documentation that was not done during the incident, as well as any additional documentation that may be beneficial in future incidents._\n\n**PhishER**\n* If applicable, create YARA rules to identify future reports of similar messages. \n\n**MISP**\n* Publish data to MISP. \n\n**ServiceNow**\n* Close ServiceNow ticket.","title":"Lessons Learned","order":4,"group":"STAGE 5"}],"titlePrefix":"EMAIL","severity":2,"name":"Compromised Email Account","tlp":2,"description":"An email account that has been compromised.  Signs of compromise may be phishing/spam emails sent from the account, suspicious O365 login, etc.","status":"Ok"}