{"customFields":{},"titlePrefix":"SYS COMP","pap":2,"name":"Linux/Unix Intrusion","metrics":{},"description":"A Linux/Unix system has been compromised.","severity":2,"tlp":2,"status":"Ok","tasks":[{"description":"_Objective:  Gather events from various sources (log files, error messages,etc.) in order to determine if an incident has occurred.  If an incident has occurred, determine scope and parties involved.  This is also the phase where incident responders should be documenting everything that they are doing, as stated earlier these documents should be able to answer the Who, What, Where, Why, and How questions._\n\n**Identify unusual activity**\n* Unusual accounts\n   * Identify suspicious entries in /etc/passwd (UID 0) and /etc/shadow\n* Unusual files\n* Unusual services\n* Unusual network activity\n* Unusual automated tasks\n* Unusual log entries\n* Unusual kernel log entries\n* Verify all file hashes\n\n**Upload Obervables**\n* Unusual files \n* IP Addresses \n* URLs  \n\n**Run Analyzers**","title":"Identification","order":0,"group":"STAGE 1"},{"description":"_Objective: Limit the damage and prevent any further damage from happening. Short term containment followed by long term solution._\n\n* Isolate system(s) on network\n* Create forensic image of system(s)\n* Remove accounts/backdoors left by attackers on affected systems\n* Find all files used by the attacker and understand their function\n* Check all files recently accessed\n* Inspect network shares to see if malware has spread\n* Identify how attacker infected system, keeping in mind it could be from physical access (insider threat)\n* Apply patches/fixes when applicable in cases where attack vector used known vulnerability","title":"Containment","order":1,"group":"STAGE 2"},{"description":"_Objective: Ensure all proper steps were taken to remove malicious and other illicit content and all systems have been restored to a clean stated._\n\nExample: using original disk image to restore system then install patches and disable unused services to harden system. Scan affected system to ensure no malware remains.\n\n* Temporarily remove all access to the accounts involved in the incident. \n* Remove all malicious files installed by the attacker. ","title":"Remediation","order":2,"group":"STAGE 3"},{"description":"_Objective: Ensure all proper steps were taken to remove malicious and other illicit content and all systems have been restored to a clean stated._\n\n* Restore system from known good image. \n* Change all system's accounts passwords. \n* Restore all binaries that may have been changed . ","title":"Recovery","order":3,"group":"STAGE 4"},{"description":"_Objective: Complete any documentation that was not done during the incident, as well as any additional documentation that may be beneficial in future incidents._\n\n**MISP**\n* Publish data to MISP. \n\n**ServiceNow**\n* Close ticket.","title":"Lessons Learned","order":4,"group":"STAGE 5"}]}